#+title: Evaluaci贸n de la exposici贸n
#+author: Gunnar Wolf

* Aritm茅tica Binaria

- Tema presentado por :: Gerardo Torres
- Calificaci贸n global :: Por favor revisen m谩s adelante para ver de
  d贸nde vienen todos estos n煤meros 

|------------------------+-------+--------------------+------+---------|
| Evaluaci贸n  compa帽eros | Valor | Evaluaci贸n docente | Peso | *Total* |
|------------------------+-------+--------------------+------+---------|
|                   8.64 |   0.3 |               8.63 |  0.7 |    8.63 |
|------------------------+-------+--------------------+------+---------|
#+TBLFM: @2$5=$1*$2+$3*$4;f-2

* Comentarios

Dado que es una presentaci贸n en video, no puedo evaluar /dominio del tema/ y
/presencia/ como lo har铆amos habitualmente. Me centro en las respuestas que
hagan a las preguntas de sus compa帽eros para el primero y en si la presentaci贸n
"suena" le铆da directamente del material que prepararon o expuesta m谩s libremente
para el segundo.


* Evaluaci贸n grupal

|              | 1 | 2 | 3 | 4 | 5 | Total |
|--------------+---+---+---+---+---+-------|
| Originalidad | 0 | 0 | 1 | 6 | 3 |   8.4 |
| Nivel        | 0 | 0 | 0 | 5 | 5 |    9. |
| Relevancia   | 0 | 0 | 2 | 5 | 3 |   8.2 |
| Claridad     | 0 | 0 | 1 | 4 | 5 |   8.8 |
| Presencia    | 0 | 0 | 0 | 6 | 4 |   8.8 |
|--------------+---+---+---+---+---+-------|
|              |   |   |   |   |   |  8.64 |
#+TBLFM: @2$7..@6$7=10 * (0.2*$2 + 0.4*$3 + 0.6*$4 + 0.8*$5 + $6 ) / vsum($2..$6)::@7$7=vmean(@2$7..@6$7); f-2

** Comentarios de los compa帽eros

Tu exposici贸n recibi贸 los siguientes comentarios anonimizados por
parte de tus compa帽eros:

- El video es muy largo, teniendo en cuenta la idea principal que se quiere
  comunicar al principio
- Me gustar铆a un poco m谩s de participaci贸n
- Es un tema que durante la carrera se ha estudiado m谩s de una vez. Sin embargo,
  repasarlo fue algo positivo. Quiz谩s me falt贸 incluir una explicaci贸n de c贸mo
  se relaciona con los Sistemas Operativos. La explicaci贸n fue clara y fluida, y
  pude percibir el dominio del tema por parte de Gerardo.
- Buena Expo en general
- Es un tema relevante para la materia, anqu茅 creo que es m谩s importante para la
  materia anterior a S.O, pues la mayor铆a de lo presentado en la exposici贸n lo
  aprend铆 en Estructura y programaci贸n de computadoras.
- Es informaci贸n muy completa y los ejemplos ayudan a entender mejor, pero
  tambi茅n esto hace que se haga demasiado extensa.
- En algunos partes de la exposici贸n podr铆a omitir algunos ejemplos o
  explicarlos de manera m谩s general, como en la suma y resta de binarios, ya que
  pienso que no era tan necesario explicar cada caso (si bien, te ayuda a
  entender mejor, aumenta mucho la duraci贸n del video).

* Evaluaci贸n por parte del docente

| *Aspecto*              | *Peso* | *Evaluaci贸n* | *Puntos* |
|------------------------+--------+--------------+----------|
| Originalidad del tema  |    0.1 |           10 |       1. |
| Material desarrollado  |    0.2 |          7.5 |      1.5 |
| Contenido              |    0.2 |          7.5 |      1.5 |
| Fuentes bibliogr谩ficas |    0.1 |           10 |       1. |
| Uso del tiempo         |    0.1 |           10 |       1. |
| Dominio del tema       |   0.15 |           10 |      1.5 |
| Presencia              |   0.15 |          7.5 |    1.125 |
|------------------------+--------+--------------+----------|
| *Global*               |        |              |     8.63 |
#+TBLFM: @<<$4..@>>$4=$2*$3::$4=vsum(@<<..@>>);f-2

** Comentarios
- Elegiste un tema complicado. Explicaste muy bien la /representaci贸n/ de los
  valores num茅ricos en base 2, pero la exposici贸n no aborda /mucho/ de lo bonito
  de la aritm茅tica: multiplicaciones y divisiones.
  - La suma est谩 bien explicada, pero a la resta le falt贸 claridad. Aplaudo el
    esfuerzo que le dedicaste, que resulta claro, pero tu explicaci贸n sobre la
    resta resulta incompleta y m谩s bien dif铆cil de seguir 
  - Comenzaste a explicar la representaci贸n de n煤meros fraccionales, pero no lo
    desarrollaste m谩s. Parec铆a que ibas a meterte de lleno a explicar el formato
    de punto flotante, IEEE754:

        https://es.wikipedia.org/wiki/IEEE_754

    Aunque sin duda reconozco que ser铆a meter demasiada complejidad.
